fitur revisi tahap 5-6
